# Pandas 학습

1. 데이터 분석을 위한 모듈: 절대적
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
> 1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
> 2. series - DataFrame을 구성하는 column 간주

**참고**

주피터 노트북 익스텐션을 활용하여 생산성 높이기
>pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

사용하는 기능
- pep 8 코딩 컨벤션 체크 및 포맷 정리 기능
- 목차

In [ ]:
# !pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

## 기초 익히기
> 이미 존재하는 파일의 내용으로 DataFrame 생성하기 <br>
> 중복 데이터 제거 <br>
> 결측시 처리

## DataFrame  & Series 구조 
> https://pandas.pydata.org/docs/getting_started/index.html <br>

In [11]:
# 전처리를 위한 library import
# as 키워드는 library에 별칭 부여: pd를 관습적으로 씀

import numpy as np
import pandas as pd

In [4]:
!pip show pandas

Name: pandas
Version: 1.1.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: pytz, python-dateutil, numpy
Required-by: statsmodels, seaborn

In [5]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

기초 익히기

In [6]:
# 시리즈 - 정수값으로 생성시 자동으로 int64 (64비트 저장 가능한 정수)
# 시리즈 (객체) 생성 문법

s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [7]:
print(s)

0    1
1    2
2    3
dtype: int64

In [8]:
type(s)

pandas.core.series.Series

In [9]:
# 시리즈 객체가 보유한 데이터
s.values

array([1, 2, 3], dtype=int64)

In [10]:
# 시리즈 객체가 가진 인덱스 정보
s.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
# 결측치 - 데이터값이 없음을 의미, nan(Not a Number, 숫자가 아님)
# js에서 숫자가 아님을 의미하는 데이터 표현법
# 파이썬에서는 결측치를 의미

# 명시적으로 시리즈에 결측치 적용
# numpy api에 결측치 표현법이 있음

# 데이터 관리를 위해 결측치도 임의로 생성해야 할 경우도 있음

s = pd.Series([1, np.nan, 3, 4, np.nan])
s

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
dtype: float64

In [15]:
# 시리즈가 보유하고 있는 유효한 데이터 개수 count (결측치 제외)
s.count()

3

In [18]:
# 최상의 output을 위해 결측치 처리해야 할 때 있음(삭제? 대체? - 평균? 중앙값? 최빈값? ... 고민해봐야 함)

s.fillna(0)   # 결측치를 0으로 치환한 새로운 시리즈 생성

# 0으로 치환한 시리즈를 재대입
s = s.fillna(0)
s

0    1.0
1    0.0
2    3.0
3    4.0
4    0.0
dtype: float64

In [19]:
s = pd.Series([1, np.nan, 3, 4, np.nan])
print(s)

s = s.fillna(10)
print(s)

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
dtype: float64
0     1.0
1    10.0
2     3.0
3     4.0
4    10.0
dtype: float64

In [20]:
# 결측치 삭제

s = pd.Series([1, np.nan, 3, 4, np.nan])
print(s)

s = s.dropna()
print(s)

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
dtype: float64
0    1.0
2    3.0
3    4.0
dtype: float64

## 날짜와 문자열 데이터 다루기 


- Python의 datetime모듈

>date : 연, 월, 일

>time : 시간, 분, 초, 마이크로초(백만분의 1초)

>datetime : date와 time요소

- Pandas의 Timestamp

>날짜와 시간 모두 포함 : 나노초(10억분의 1초) 단위의 정밀도


- timedelta

>날짜의 덧셈과 뺄셈에 유용

### 특정 날짜를 기준으로 DataFrame생성해 보기

In [21]:
# 6일치의 날짜 데이터 생성
# date_range(시작일, 범위): 시작일로부터 해당 범위 날짜까지 자동 생성

datas = pd.date_range('20210628', periods=6)
datas

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

### 날짜를 index로 적용해서 dataframe 객체 생성

In [22]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [23]:
# 2행 3열의 실수 난수값 발생 함수: 구조 포함된 난수 발생
np.random.randn(2, 3)

array([[-0.8863209 ,  1.23736724, -0.99990131],
       [ 1.27853672,  0.14146885,  0.56698305]])

In [26]:
# 정수 범위 내의 난수 발생 함수 (0~11)
np.random.randint(12)

10

In [29]:
np.random.randint(2, 3)   # 2~3 사이의 정수 난수 발생: 범위에 해당하는 하나의 정수값만 발생

2

In [30]:
# 6 by 4: 6행 4열(6*4) 구조의 DataFrame 생성. 데이터는 자동 생성되는 난수값 활용.
# 날짜를 보유한 datas 변수값을 index로 구성하는 DataFrame 객체

# pandas로 데이터 처리 시에 numpy 모듈은 필수

df = pd.DataFrame(np.random.randn(6, 4), index=datas)
df

                   0         1         2         3
2021-06-28 -0.563120  0.482014 -0.783486 -1.127380
2021-06-29  0.857287 -0.139765 -0.635136  0.693456
2021-06-30 -0.597331 -0.402517  0.463470  0.298717
2021-07-01 -0.134222 -0.430192 -0.951707 -0.173449
2021-07-02  0.663823  0.509349  0.801392  0.966702
2021-07-03  1.135836  1.404221  0.288045  1.670025

In [31]:
# 컬럼명 가공

df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28  0.136759  0.538820 -1.584380 -0.507051
2021-06-29  0.589752 -0.419161 -0.578723 -1.195248
2021-06-30  0.108035  0.591597  0.997941 -1.294266
2021-07-01 -0.830874  0.308272  0.106049  1.058972
2021-07-02 -0.208286 -0.426908 -1.426683 -0.014203
2021-07-03 -1.512260 -0.053409 -0.341328  0.306039

In [34]:
# df의 value
df.values

array([[ 0.13675877,  0.53881978, -1.58438045, -0.5070507 ],
       [ 0.58975177, -0.41916102, -0.57872341, -1.19524836],
       [ 0.10803514,  0.59159698,  0.9979407 , -1.29426576],
       [-0.83087445,  0.30827227,  0.10604947,  1.05897183],
       [-0.20828617, -0.42690796, -1.42668327, -0.01420309],
       [-1.51226013, -0.05340932, -0.34132774,  0.30603857]])

In [35]:
# df의 index
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [37]:
# df의 columns
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
# 차후 머신/딥러닝 시에 데이터 구조를 자주 봐야 함
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-06-28 to 2021-07-03
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1   b       6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
dtypes: float64(4)
memory usage: 400.0 bytes

In [39]:
df.describe()

# 이상치/결측치 확인을 위해 기초 통계를 보고 75% 지점에 있는 값과 max() 값의 갭이 너무 크면 이상치로 간주하는 분석 기법도 있음

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.286146  0.089868 -0.471187 -0.274293
std    0.762571  0.457752  0.966658  0.908263
min   -1.512260 -0.426908 -1.584380 -1.294266
25%   -0.675227 -0.327723 -1.214693 -1.023199
50%   -0.050126  0.127431 -0.460026 -0.260627
75%    0.129578  0.481183 -0.005795  0.225978
max    0.589752  0.591597  0.997941  1.058972

In [40]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28 -0.463100 -0.151500  0.483474  0.079791
2021-06-29 -0.070125  0.077428 -0.446092  1.798288
2021-06-30 -0.247198 -1.135271 -0.057333 -0.746602
2021-07-01 -0.996129 -0.555035 -0.668026 -0.192416
2021-07-02 -0.075815 -0.006210  0.415586 -0.284179
2021-07-03 -1.001906 -1.728609  0.188898  2.178906

In [41]:
# b 컬럼에 대한 오름차순 정렬 설정
# 내림차순: ascending=False
df.sort_values(by='b', ascending=True)

                   a         b         c         d
2021-07-03 -1.001906 -1.728609  0.188898  2.178906
2021-06-30 -0.247198 -1.135271 -0.057333 -0.746602
2021-07-01 -0.996129 -0.555035 -0.668026 -0.192416
2021-06-28 -0.463100 -0.151500  0.483474  0.079791
2021-07-02 -0.075815 -0.006210  0.415586 -0.284179
2021-06-29 -0.070125  0.077428 -0.446092  1.798288

In [42]:
df.sort_values(by='b', ascending=False)

                   a         b         c         d
2021-06-29 -0.070125  0.077428 -0.446092  1.798288
2021-07-02 -0.075815 -0.006210  0.415586 -0.284179
2021-06-28 -0.463100 -0.151500  0.483474  0.079791
2021-07-01 -0.996129 -0.555035 -0.668026 -0.192416
2021-06-30 -0.247198 -1.135271 -0.057333 -0.746602
2021-07-03 -1.001906 -1.728609  0.188898  2.178906

In [44]:
# 특정 컬럼들 값만 도출해보기
# 브래킷 연산자와 컬럼명으로 컬럼 도출

df['a']

2021-06-28   -0.463100
2021-06-29   -0.070125
2021-06-30   -0.247198
2021-07-01   -0.996129
2021-07-02   -0.075815
2021-07-03   -1.001906
Freq: D, Name: a, dtype: float64

In [47]:
# 도트 연산자로도 특정 컬럼 도출 가능

df.a

2021-06-28   -0.463100
2021-06-29   -0.070125
2021-06-30   -0.247198
2021-07-01   -0.996129
2021-07-02   -0.075815
2021-07-03   -1.001906
Freq: D, Name: a, dtype: float64

In [45]:
df['a', 'b']   # error

KeyError: ('a', 'b')

In [46]:
# 두 개 이상의 컬럼값을 보고 싶을 때는 list 구조로 적용
# df[]: 특정 컬럼을 도출함을 의미하는 문법
# ['a', 'b']: a와 b 컬럼을 검색하겠다는 list

df[['a', 'b']]

                   a         b
2021-06-28 -0.463100 -0.151500
2021-06-29 -0.070125  0.077428
2021-06-30 -0.247198 -1.135271
2021-07-01 -0.996129 -0.555035
2021-07-02 -0.075815 -0.006210
2021-07-03 -1.001906 -1.728609

In [48]:
# index로 데이터 값 도출

df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [49]:
# 콜론을 기준으로 슬라이싱해서 데이터 도출
# index명으로 시작과 끝을 정함 (숫자일 때는 -1되지만 밸류일 때는 해당까지 포함)

df['2021-06-28':'2021-07-01']

                   a         b         c         d
2021-06-28 -0.463100 -0.151500  0.483474  0.079791
2021-06-29 -0.070125  0.077428 -0.446092  1.798288
2021-06-30 -0.247198 -1.135271 -0.057333 -0.746602
2021-07-01 -0.996129 -0.555035 -0.668026 -0.192416

In [50]:
# index의 위치값인 순번으로 데이터 도출
# 0부터 4-1까지.

df[0:4]

                   a         b         c         d
2021-06-28 -0.463100 -0.151500  0.483474  0.079791
2021-06-29 -0.070125  0.077428 -0.446092  1.798288
2021-06-30 -0.247198 -1.135271 -0.057333 -0.746602
2021-07-01 -0.996129 -0.555035 -0.668026 -0.192416

In [58]:
# iloc라는 속성을 통해서 데이터 검색 가능 - index location을 의미
# iloc[index, column]

df.iloc[0:3, 0:2]

                   a         b
2021-06-28 -0.463100 -0.151500
2021-06-29 -0.070125  0.077428
2021-06-30 -0.247198 -1.135271

### file로부터 데이터 read해서 date 타입 이해하기

In [59]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: DA0E-26C3

 C:\Users\Playdata\playdata\202105_lab\07.PythonLib 디렉터리

2021-06-28  오후 12:41    <DIR>          .
2021-06-28  오후 12:41    <DIR>          ..
2021-06-28  오후 12:31    <DIR>          .ipynb_checkpoints
2021-06-28  오전 09:45             1,297 0628_class.txt
2021-06-28  오전 10:13    <DIR>          dataset
2021-06-28  오후 12:41            65,815 step01_PandasBasic_s.ipynb
2021-06-28  오후 12:31            26,947 step02_PandasReview_s.ipynb
               3개 파일              94,059 바이트
               4개 디렉터리  149,391,994,880 바이트 남음

In [60]:
# 01.date_data.csv
# csv 파일의 내용을 read하면서 DataFrame 객체로 생성
# DataFrame 객체의 장점은 다양한 함수가 있기 때문에 데이터 조작 및 정제 가능

# 가정사항: csv 파일은 제공 받음, 단 raw데이터는 보존해야 함. 정제 및 분석을 위해서는 최적 상태로 가공 필요
# 문제점 찾기: \t, at

# 사용 빈도가 매우 높은 함수
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [61]:
# dtypes: 문자열 타입을 object 타입으로 표현
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     object
 2   email   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [62]:
# format='%Y-%m-%d %H:%M:%S'

df.columns

Index(['Name', 'Birth', 'email'], dtype='object')

In [63]:
df.values

array([['이순신', '2021-01-01 9:10', 'happy@gmail.com '],
       ['홍길동', '2021-01-08 9:20', '  1004@NAVER.COM'],
       ['유관순', '2021-02-01 10:20', ' Iron at yahoo.co.kr '],
       ['이이', '2021-02-02 11:40', '\tlee@gmail.com'],
       ['김구', '2021-02-28 15:10', 'kim@daum.net\t'],
       ['윤봉길', '2021-04-10 19:20', 'yeon@daum.ac.kr'],
       ['강감찬', '2021-06-30 21:20', 'kkc@gmail.com'],
       ['신사임당', '2021-07-20 23:30', 'monther@NAVER.COM '],
       ['을지문덕', '2021-08-28 11:48', '    ygmd@daum.net'],
       ['유재석', '2021-09-01 3:12', 'yjs at gmail.com']], dtype=object)

In [64]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [66]:
df['Birth']

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [67]:
# object type, 즉 문자열 타입을 datetime type으로 변환하는 구조

df['Birth'] = pd.to_datetime(df['Birth'], format='%Y-%m-%d %H:%M:%S')
df

   Name               Birth                  email
0   이순신 2021-01-01 09:10:00       happy@gmail.com
1   홍길동 2021-01-08 09:20:00         1004@NAVER.COM
2   유관순 2021-02-01 10:20:00   Iron at yahoo.co.kr
3    이이 2021-02-02 11:40:00        \tlee@gmail.com
4    김구 2021-02-28 15:10:00         kim@daum.net\t
5   윤봉길 2021-04-10 19:20:00        yeon@daum.ac.kr
6   강감찬 2021-06-30 21:20:00          kkc@gmail.com
7  신사임당 2021-07-20 23:30:00     monther@NAVER.COM
8  을지문덕 2021-08-28 11:48:00          ygmd@daum.net
9   유재석 2021-09-01 03:12:00       yjs at gmail.com

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     datetime64[ns]
 2   email   10 non-null     object
dtypes: datetime64[ns](1), object(2)
memory usage: 368.0+ bytes

In [71]:
# '2019-01-01' : 문자열
# pd.to_datetime('2019-01-01'): 문자열을 datetime, 즉 날짜 표현 타입으로 전환
# 빼기를 해서 경과일을 도출

eday = df['Birth'] - pd.to_datetime('2019-01-01')
eday

0   731 days 09:10:00
1   738 days 09:20:00
2   762 days 10:20:00
3   763 days 11:40:00
4   789 days 15:10:00
5   830 days 19:20:00
6   911 days 21:20:00
7   931 days 23:30:00
8   970 days 11:48:00
9   974 days 03:12:00
Name: Birth, dtype: timedelta64[ns]

###  경과시간 계산

- timedelta64[??] : 날짜의 덧셈과 뺄셈에 유용
  - Y : 연 
  - M : 월 
  - D : 일 
  - m : 분 
  - s : 초

In [72]:
# 경과 시간을 day를 기준으로 일 데이터만 도출
# 소수점 표현 의미 없을 경우 삭제. astype() 함수로 체이닝기술 적용

eday.astype('timedelta64[D]')

0    731.0
1    738.0
2    762.0
3    763.0
4    789.0
5    830.0
6    911.0
7    931.0
8    970.0
9    974.0
Name: Birth, dtype: float64

In [76]:
# 최종적으로 int로 정제
eday.astype('timedelta64[D]').astype('int')

0    731
1    738
2    762
3    763
4    789
5    830
6    911
7    931
8    970
9    974
Name: Birth, dtype: int32

In [73]:
eday.astype('timedelta64[Y]')

0    2.0
1    2.0
2    2.0
3    2.0
4    2.0
5    2.0
6    2.0
7    2.0
8    2.0
9    2.0
Name: Birth, dtype: float64

In [74]:
eday.astype('timedelta64[M]')

0    24.0
1    24.0
2    25.0
3    25.0
4    25.0
5    27.0
6    29.0
7    30.0
8    31.0
9    32.0
Name: Birth, dtype: float64

In [75]:
eday.astype('timedelta64[m]')

0    1053190.0
1    1063280.0
2    1097900.0
3    1099420.0
4    1137070.0
5    1196360.0
6    1313120.0
7    1342050.0
8    1397508.0
9    1402752.0
Name: Birth, dtype: float64

## 인덱서(indexer)

### iloc(index location)
- 데이터 프레임의 부분집합 선택을 위한 도구
- iloc는 정수로만 선택
- 여러 개의 정수 위치를 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기
- iloc[index] or iloc[index, columnindex]

In [77]:
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [78]:
df.iloc[2]

Name                       유관순
Birth         2021-02-01 10:20
email     Iron at yahoo.co.kr
Name: 2, dtype: object

In [79]:
df.iloc[0, 0]

'이순신'

In [80]:
df.iloc[1, 1]

'2021-01-08 9:20'

In [82]:
df.iloc[1:3, 0]

1    홍길동
2    유관순
Name: Name, dtype: object

In [83]:
# DataFrame의 앞 영역 5개의 인덱스 반환
df.head()

  Name             Birth                  email
0  이순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [84]:
df.iloc[4, 2]

'kim@daum.net\t'

In [85]:
# 콜론만 찍으면 모든 시리즈/컬럼 검색
df.iloc[1:3, :]

  Name             Birth                  email
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr

### loc 속성

- 데이터들을 slicing 하는 기술
- loc[index, columns]
- loc는 레이블로만 선택
- 여러 개의 레이블을 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기 사용
- 마지막 레이블까지 포함

In [97]:
df = pd.read_csv('dataset/01.date_data.csv')
df.head(3)

  Name             Birth                  email
0  이순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr

In [88]:
df.tail(3)

   Name             Birth               email
7  신사임당  2021-07-20 23:30  monther@NAVER.COM
8  을지문덕  2021-08-28 11:48       ygmd@daum.net
9   유재석   2021-09-01 3:12    yjs at gmail.com

In [89]:
# 모든 로우값 가져오되 가져오는 시리즈에 조건
df.loc[:, ['Name', 'Birth']]

   Name             Birth
0   이순신   2021-01-01 9:10
1   홍길동   2021-01-08 9:20
2   유관순  2021-02-01 10:20
3    이이  2021-02-02 11:40
4    김구  2021-02-28 15:10
5   윤봉길  2021-04-10 19:20
6   강감찬  2021-06-30 21:20
7  신사임당  2021-07-20 23:30
8  을지문덕  2021-08-28 11:48
9   유재석   2021-09-01 3:12

In [93]:
# 데이터 수정
print(df.iloc[0, 0])
print(df.loc[0, 'Name'])

이순신
이순신

In [95]:
df.loc[0, 'Name'] = '김순신'
df.head()

  Name             Birth                  email
0  김순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [99]:
# 새로운 시리즈(컬럼) 추가

df['age'] = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
df

   Name             Birth                  email  age
0   이순신   2021-01-01 9:10       happy@gmail.com    10
1   홍길동   2021-01-08 9:20         1004@NAVER.COM   20
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr    30
3    이이  2021-02-02 11:40        \tlee@gmail.com   40
4    김구  2021-02-28 15:10         kim@daum.net\t   50
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr   60
6   강감찬  2021-06-30 21:20          kkc@gmail.com   70
7  신사임당  2021-07-20 23:30     monther@NAVER.COM    80
8  을지문덕  2021-08-28 11:48          ygmd@daum.net   90
9   유재석   2021-09-01 3:12       yjs at gmail.com  100

In [100]:
del df['age']   # 특정 시리즈를 삭제하는 명령어 - javascript와 동일
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

- file로부터 데이터 read해서 DataFrame 생성
- DataFrame의 특정 데이터값 착출 / 수정
- 새로운 Series 추가
- 결측치 처리  - 대체(fillna())/삭제(dropna())

### 이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [101]:
df = pd.read_csv('dataset/02.friends.csv')
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [102]:
type(df)

pandas.core.frame.DataFrame

In [103]:
df.loc[3, '나이']

45

In [107]:
df = pd.read_csv('dataset/03.friendsTab.txt')
print(df)
# tab으로 데이터 구분한 파일(tab seperated value[tsv]), 확장자 *.tsv로 저장
# txt파일의 포맷은 문제가 없는데 DataFrame으로 변환 시 문제 발생
# 해결: read_csv에 구분자 속성으로 쉼표가 구분가가 아닌 tab이 구분자라는 것을 명확히 표현
# tab 표현: \t

df = pd.read_csv('dataset/03.friendsTab.txt', delimiter='\t')
print(df)

     이름\t나이\t직업\thobby
0  신동엽\t20\t연예인\tmusic
1     유재석\t41\t교수\tart
2   김새롬\t18\t학생\tstudy
3   이영자\t45\t상담사\ttalk
4   강호동\t38\t연예인\ttalk
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [110]:
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t')
print(df)

# 문제점: 데이터가 header처럼 쓰임
# 해결: 새로운 컬럼명 추가

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [112]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [113]:
# header가 없는 외부 파일 read 시에 header 미적용 설정
# 데이터가 컬럼명으로 적용되지 않음

df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t', header=None)
print(df)

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [117]:
# header 정보 추가 - names라는 속성으로 추가

df = pd.read_csv('dataset/04.friendsTabNoHead.txt',
                 delimiter='\t', names=['name', 'age', 'job', 'hobby'])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [118]:
# sal 급여 시리즈 추가, 단 학생인 경우 급여는 no로 변환, 학생이 아닌 경우는 yes로 변환
# 조건에 따라 다른 데이터 적용(조건별 값 차별화)

# sal이라는 컬럼에 0값 적용
df['sal'] = 0
df

  name  age  job  hobby  sal
0  신동엽   20  연예인  music    0
1  유재석   41   교수    art    0
2  김새롬   18   학생  study    0
3  이영자   45  상담사   talk    0
4  강호동   38  연예인   talk    0

In [124]:
# job이 학생을 제외한 모든 친구들은 sal에 yes
# 3항 연산자: 조건식? 조건식이 true인 경우 시행, 조건식이 false인 경우 실행 --> 3개의 항목으로 구성

df['job'] == '학생'

# 삼항 연산식을 numpy의 where이라는 함수의 parameter로 적용 시 syntax
df['sal'] = np.where(df['job'] != '학생', 'yes', 'no')
df

  name  age  job  hobby  sal
0  신동엽   20  연예인  music  yes
1  유재석   41   교수    art  yes
2  김새롬   18   학생  study   no
3  이영자   45  상담사   talk  yes
4  강호동   38  연예인   talk  yes

### python의 데이터를 DataFrame 객체로 변환하기

- dict의 key를 DataFrame의 Series로 자동 변환
- 차후 데이터 수집 및 관리 시에 어떤 구조로 데이터를 수집/취합하는지 설계 가능

In [122]:
# 딕셔너리들로 구성된 하나의 리스트
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]
type(friend_dict_list)

list

In [123]:
df = pd.DataFrame(friend_dict_list)
print(df)
print(type(df))

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
<class 'pandas.core.frame.DataFrame'>

### 중복 데이터 제거 기술

In [125]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [126]:
# 중복 데이터 여부 확인 가능한 함수
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [127]:
# duplicated()의 결과값으로 True였던 row 값만 삭제 - 중복 데이터 삭제
df = df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [128]:
# step02 - 속성으로 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [129]:
# keep 속성으로 마지막 중복 데이터 유지하고 첫 번째 데이터 삭제
df.drop_duplicates(keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [ ]:
# step03 - 동명이인일 경우에 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

In [139]:
# 원본 DataFrame에서 수정해서 새로 생성된 DataFrame 객체
# df 에 대입하지 않을 경우 원본 유지되는 구조

df.drop_duplicates('name', keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [140]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [130]:
# step04 - 원본 DataFrame 자체에 수정 사항 바로 반영하는 속성

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [142]:
#inplace=True : 원본에 실제 변경 사항을 여과없이 적용, 원본 수정

df.drop_duplicates('name', keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   50  연예인  music

In [144]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   job     5 non-null      object
 3   hobby   5 non-null      object
dtypes: int64(1), object(3)
memory usage: 200.0+ bytes

### 결측치 처리

In [145]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]
df = pd.DataFrame(friend_dict_list)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [146]:
# index=5 위치의 신동엽 age는 결측치
# info() non-null의 카운트로 결측치 여부 확인 가능
# 처리 방법?
# age는 절대 결측치일 수 없음... age의 NaN을 삭제? 대체? (평균? 중앙값? 최빈값?...)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [147]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [148]:
# DataFrame의 null값 확인 함수, NaN에 해당하는 데이터인 경우 True값 출력
# null(결측치, NaN과 동일한 표현)
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [149]:
# age 시리즈에 대한 총합을 구하는 함수
df['age'].sum()

162.0

In [150]:
# age 시리즈에 대한 평균을 구하는 함수
df['age'].mean()

32.4

In [151]:
# age 시리즈에 대한 최댓값을 구하는 함수
df['age'].max()

45.0

In [152]:
# age 시리즈의 평균값을 결측치에 한해 적용
df['age'].fillna(df['age'].mean(), inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

### 그룹화 하기

In [189]:
# None 값을 0 값으로 치환

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

In [155]:
df.groupby('job')

1. job 종류 확인 : unique()
2. job 별 개수 확인 :  value_counts()

In [156]:
df.value_counts()

name  age   job  hobby
이영자   45.0  상담사  talk     1
유재석   41.0  교수   art      1
신동엽   32.4  연예인  music    1
      20.0  연예인  music    1
김새롬   18.0  학생   study    1
강호동   38.0  연예인  talk     1
dtype: int64

In [157]:
# value_counts(): 데이터별 개수 확인

df['job'].value_counts()

연예인    3
학생     1
상담사    1
교수     1
Name: job, dtype: int64

In [161]:
# 취미별로 그룹핑 후에 연산이 가능한 Series 값의 합을 자동 도출한 경우
df.groupby('hobby').sum()

        age
hobby
art    41.0
music  52.4
study  18.0
talk   83.0

In [164]:
# sql에서 select distinct job from emp; 이런 거랑 같은 기능
df['job'].unique()

array(['연예인', '교수', '학생', '상담사'], dtype=object)

In [167]:
# 테스트하기 위해 결측치 추가
df.iloc[5, 1] = np.nan
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [169]:
# 결측치를 중앙값(데이터를 오름차순으로 나열했을 때 가운데 값)으로 치환
# job별로 그룹핑 -> 그룹핑된 job별로 각 중앙값 도출, 그 중앙값으로 age 시리즈 치환

# 중앙값을 판별해야 하는 데이터 개수가 홀수면 진짜 정중앙 데이터
# 짝수일 땐 중앙 두 개 값의 평균값
df['age'] = df.groupby('job')['age'].transform('median')
df

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk
5  신동엽  29.0  연예인  music

In [ ]:
# 데이터 제공

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                    {'name': '고현정', 'age': 44, 'job': '가수', 'hobby': 'music'},
                    {'name': '박민영', 'age': 22, 'job': '학생', 'hobby': 'art'},
                    {'name': '박서준', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '박보검', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '이효리', 'age': 28, 'job': '교수', 'hobby': 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

### 조건 기반 필터링

- Pandas의 비교 및 논리 연산자
- 비교 연산자는 기본 연산자를 사용
- AND : &
- OR : |
- NOT : ~ (틸드 연산자, 부정 연산자)
- 논리 연산에 기본 연산자를 사용할 경우 객체
전체의 참을 계산하기 때문에 오류 발생
- 각 표현은 괄호로 묶는 것은 권장

In [170]:
df.head()

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk

In [171]:
# 동등비교연산자
df.name == '신동엽'

0     True
1    False
2    False
3    False
4    False
5     True
Name: name, dtype: bool

In [172]:
f1 = df.name == '신동엽'
f1
# 비교한 결과치를 f1에 대입

0     True
1    False
2    False
3    False
4    False
5     True
Name: name, dtype: bool

In [173]:
f1 = df.name == '김새롬'
f2 = df.job == '학생'

f1 & f2

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [174]:
# True값을 보유한 값을 기준으로 새로운 DataFrame 객체 생성
df2 = df[f1 & f2]
df2

  name   age job  hobby
2  김새롬  18.0  학생  study

<hr>

**미션**

1. hobby 종류 확인: unique()로 list로 반환
2. hobby 종류의 총수 확인: unique()의 결과를 len()으로 개수 확인
3. 종류별 개수: value_counts()로 범주별 counting

In [192]:
df['hobby'].unique()

array(['music', 'art', 'study', 'talk'], dtype=object)

In [193]:
df.hobby.unique()

array(['music', 'art', 'study', 'talk'], dtype=object)

In [190]:
df['hobby'].value_counts()

talk     2
music    2
art      1
study    1
Name: hobby, dtype: int64

In [194]:
len(df.hobby.unique())   # 취미 종류의 총 개수

4

### 두개의 DataFrame 병합하기 - row 기준

In [1]:
import pandas as pd

In [2]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]

In [4]:
l1

[{'name': '이효리', 'job': '교수'},
 {'name': '이상순', 'job': '학생'},
 {'name': '박보검', 'job': '개발자'}]

In [5]:
type(l1)

list

In [3]:
# list를 기준으로 DataFrame 생성, 컬럼명을 명시(columns라는 속성으로)

df1 = pd.DataFrame(l1, columns=['name', 'job'])
df2 = pd.DataFrame(l2, columns=['name', 'job'])

print(df1)
print(type(df1))
print(df1.ndim)   # 2차원
print(df1.shape)   # 3행 2열

print('-'*20)

print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
<class 'pandas.core.frame.DataFrame'>
2
(3, 2)
--------------------
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [178]:
# 두 개의 DataFrame을 하나로 결합(merge)
# concat([결합시킬 데이터 시리즈들], axis=?, ignore_index=True) 결합함수: 기본적으로 상하로 결합
# 결합되는 데이터 타입은 list. axis=0 상하/ axis=1 좌우

df_all = pd.concat([df1, df2])
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [179]:
# 두 개의 DataFrame이 좌우로 결합 
# axis(기준이 되는 축)=1: 컬럼/시리즈를 추가하는 구조로 결합
df_all = pd.concat([df1, df2], axis=1)
df_all

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [188]:
# 두 개의 DataFrame이 상하로 결합, row를 증가시키는 구조
# axis는 축... 얘를 어떻게 설정하느냐에 따라...
df_all = pd.concat([df1, df2], axis=0)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [185]:
# index의 재정렬이 필요

df_all = pd.concat([df1, df2], axis=0, ignore_index=True)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인